In [6]:
import numpy as np

In [7]:
import pandas as pd

In [8]:
x =['a','b','c','d','e']
y = [1,2,3,4,5]
z = {1:'a',2:'b',3:'c',4:'d',5:'e'}

In [9]:
a = pd.Series(data = x)

In [10]:
a

0    a
1    b
2    c
3    d
4    e
dtype: object

In [11]:
type(a)

pandas.core.series.Series

In [12]:
a = pd.Series(data = x , index = y)

In [13]:
a

1    a
2    b
3    c
4    d
5    e
dtype: object

In [14]:
a = pd.Series(x,y)

In [15]:
a

1    a
2    b
3    c
4    d
5    e
dtype: object

In [16]:
a = pd.Series(y,x)

In [17]:
a

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [18]:
a = pd.Series(z)

In [19]:
a

1    a
2    b
3    c
4    d
5    e
dtype: object

In [20]:
x =['a','b','c','d','e']
x2 =['a','b','c','d','e']
y = [1,2,3,4,5]
z = {1:'a',2:'b',3:'c',4:'d',5:'e'}

In [26]:
a = pd.Series(x2,y)
b = pd.Series(x2,x)

In [27]:
a

1    a
2    b
3    c
4    d
5    e
dtype: object

In [28]:
b

a    a
b    b
c    c
d    d
e    e
dtype: object

In [29]:
a + b

1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
a    NaN
b    NaN
c    NaN
d    NaN
e    NaN
dtype: object

In [30]:
a = pd.Series(x,y)
b = pd.Series(x2,y)

In [31]:
a + b

1    aa
2    bb
3    cc
4    dd
5    ee
dtype: object

In [36]:
#dataframes
import numpy as np
import pandas as pd

In [37]:
A = [1,2,3,4]
B = [5,6,7,8]
C = [9,0,1,2]
D = [3,4,5,6]
E = [7,8,9,0]

In [39]:
df = pd.DataFrame([A,B,C,D,E],['a','b','c','d','e'],['w','x','y','z']) #values col row

In [42]:
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

In [44]:
df['p'] = df['y'] + df['z']

In [45]:
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

In [46]:
df.drop('e')

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [47]:
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

In [49]:
df.drop('e', inplace = True)

In [50]:
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [51]:
df.drop('p', axis =1)

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

In [52]:
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [53]:
df.drop('p', axis =1, inplace = True)

In [54]:
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

In [56]:
#acessing
df['y']

a    3
b    7
c    1
d    5
Name: y, dtype: int64

In [58]:
df.loc['a']

w    1
x    2
y    3
z    4
Name: a, dtype: int64

In [59]:
df.iloc[1]

w    5
x    6
y    7
z    8
Name: b, dtype: int64

In [60]:
df.loc()

In [63]:
df.loc['a','y']

3

In [64]:
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

In [66]:
#conditional acessing
df > 3

       w      x      y      z
a  False  False  False   True
b   True   True   True   True
c   True  False  False  False
d  False   True   True   True

In [67]:
df[df > 3]

     w    x    y    z
a  NaN  NaN  NaN  4.0
b  5.0  6.0  7.0  8.0
c  9.0  NaN  NaN  NaN
d  NaN  4.0  5.0  6.0

In [69]:
df[df['w'] > 3]

   w  x  y  z
b  5  6  7  8
c  9  0  1  2

In [70]:
df[df['w'] > 3][['w']]

   w
b  5
c  9

In [74]:
df[(df['w'] > 3) & (df['z'] > 5)]

   w  x  y  z
b  5  6  7  8

In [75]:
#missing data
import numpy as np
import pandas as pd

In [78]:
a ={'a':[1,2,3,4,5],'b':[6,7,8,9,np.nan],'c':[0,1,2,np.nan,np.nan],'d':[3,4,np.nan,np.nan,np.nan],'e':[5,np.nan,np.nan,np.nan,np.nan]}

In [79]:
a

{'a': [1, 2, 3, 4, 5],
 'b': [6, 7, 8, 9, nan],
 'c': [0, 1, 2, nan, nan],
 'd': [3, 4, nan, nan, nan],
 'e': [5, nan, nan, nan, nan]}

In [98]:
df= pd.DataFrame(a)

In [99]:
df.dropna(axis = 1)

   a
0  1
1  2
2  3
3  4
4  5

In [100]:
df.dropna()

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

In [101]:
df.dropna(thresh = 3) #atleast 3 value available

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN

In [104]:
df.fillna(1)#replaces nan values with 1.0

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  1.0
2  3  8.0  2.0  1.0  1.0
3  4  9.0  1.0  1.0  1.0
4  5  1.0  1.0  1.0  1.0

In [105]:
a

{'a': [1, 2, 3, 4, 5],
 'b': [6, 7, 8, 9, nan],
 'c': [0, 1, 2, nan, nan],
 'd': [3, 4, nan, nan, nan],
 'e': [5, nan, nan, nan, nan]}

In [108]:
df['b'].fillna(value = 1)

0    6.0
1    7.0
2    8.0
3    9.0
4    1.0
Name: b, dtype: float64

In [112]:
df['b'].fillna(value = df['b'].mean())

0    6.0
1    7.0
2    8.0
3    9.0
4    7.5
Name: b, dtype: float64

In [113]:
#analysing data by groupby

import numpy as np
import pandas as pd

In [117]:
p = {'item':['apple','apple','orange','orange','guns','guns'], 'days': ['mom','tue','wed','thus','fri','sat'],'sales':[100,80,200,100,5,10]}

In [118]:
p

{'item': ['apple', 'apple', 'orange', 'orange', 'guns', 'guns'],
 'days': ['mom', 'tue', 'wed', 'thus', 'fri', 'sat'],
 'sales': [100, 80, 200, 100, 5, 10]}

In [119]:
df= pd.DataFrame(p)

In [120]:
df

     item  days  sales
0   apple   mom    100
1   apple   tue     80
2  orange   wed    200
3  orange  thus    100
4    guns   fri      5
5    guns   sat     10

In [121]:
x = df.groupby('item')

In [122]:
x

In [123]:
x.mean()

        sales
item
apple    90.0
guns      7.5
orange  150.0

In [124]:
x.sum()

        sales
item
apple     180
guns       15
orange    300

In [125]:
x.std()

            sales
item
apple   14.142136
guns     3.535534
orange  70.710678

In [126]:
x.count()

        days  sales
item
apple      2      2
guns       2      2
orange     2      2

In [127]:
x.max()

       days  sales
item
apple   tue    100
guns    sat     10
orange  wed    200

In [128]:
x.describe()

       sales
       count   mean        std    min     25%    50%     75%    max
item
apple    2.0   90.0  14.142136   80.0   85.00   90.0   95.00  100.0
guns     2.0    7.5   3.535534    5.0    6.25    7.5    8.75   10.0
orange   2.0  150.0  70.710678  100.0  125.00  150.0  175.00  200.0

In [129]:
x.describe().transpose()

item              apple       guns      orange
sales count    2.000000   2.000000    2.000000
      mean    90.000000   7.500000  150.000000
      std     14.142136   3.535534   70.710678
      min     80.000000   5.000000  100.000000
      25%     85.000000   6.250000  125.000000
      50%     90.000000   7.500000  150.000000
      75%     95.000000   8.750000  175.000000
      max    100.000000  10.000000  200.000000

In [130]:
#joining
import numpy as np
import pandas as pd

In [132]:
x1 = {'a':[1,2,3],'b':[5,6,7]}
y1 = {'c':[3,4,5], 'd':[2,3,6]}

In [143]:
x = pd.DataFrame(x1, index = ['p1','p2','p3'])
y = pd.DataFrame(y1, index = ['p1','p4','p5'])

In [144]:
x

    a  b
p1  1  5
p2  2  6
p3  3  7

In [145]:
y

    c  d
p1  3  2
p4  4  3
p5  5  6

In [146]:
x.join(y)

    a  b    c    d
p1  1  5  3.0  2.0
p2  2  6  NaN  NaN
p3  3  7  NaN  NaN

In [147]:
x.join(y, how = 'left')

    a  b    c    d
p1  1  5  3.0  2.0
p2  2  6  NaN  NaN
p3  3  7  NaN  NaN

In [148]:
x.join(y, how = 'right')

      a    b  c  d
p1  1.0  5.0  3  2
p4  NaN  NaN  4  3
p5  NaN  NaN  5  6

In [149]:
x.join(y, how = 'outer')

      a    b    c    d
p1  1.0  5.0  3.0  2.0
p2  2.0  6.0  NaN  NaN
p3  3.0  7.0  NaN  NaN
p4  NaN  NaN  4.0  3.0
p5  NaN  NaN  5.0  6.0

In [150]:
x.join(y, how = 'inner')

    a  b  c  d
p1  1  5  3  2

In [152]:
#concatination

x1 = {'a':[1,1,1,1,1] ,'b':[1,1,1,1,1] ,'c':[1,1,1,1,1] ,'d':[1,1,1,1,1] ,'e':[1,1,1,1,1] }
x2 = {'e':[2,2,2,2,2] ,'f':[2,2,2,2,2] ,'g':[2,2,2,2,2] ,'h':[2,2,2,2,2] ,'i':[2,2,2,2,2] }

x3 = {'a':[3,3,3,3,3] ,'b':[3,3,3,3,3] ,'c':[3,3,3,3,3] ,'d':[3,3,3,3,3] ,'e':[3,3,3,3,3] }

In [153]:
df1 = pd.DataFrame(x1, index = [1,2,3,4,5])
df2 = pd.DataFrame(x2, index = [1,2,3,4,5])
df3 = pd.DataFrame(x3, index = [5,6,7,8,9])

In [154]:
df2

   e  f  g  h  i
1  2  2  2  2  2
2  2  2  2  2  2
3  2  2  2  2  2
4  2  2  2  2  2
5  2  2  2  2  2

In [155]:
pd.concat([df1,df2])

C:\Users\LENOVO\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     a    b    c    d  e    f    g    h    i
1  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
2  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
4  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
5  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0

In [156]:
pd.concat([df1,df2], axis =1)

   a  b  c  d  e  e  f  g  h  i
1  1  1  1  1  1  2  2  2  2  2
2  1  1  1  1  1  2  2  2  2  2
3  1  1  1  1  1  2  2  2  2  2
4  1  1  1  1  1  2  2  2  2  2
5  1  1  1  1  1  2  2  2  2  2

In [157]:
pd.concat([df1,df3], axis =1)

     a    b    c    d    e    a    b    c    d    e
1  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1.0  3.0  3.0  3.0  3.0  3.0
6  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
7  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
8  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
9  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0

In [158]:
pd.concat([df1,df3], axis =0)

   a  b  c  d  e
1  1  1  1  1  1
2  1  1  1  1  1
3  1  1  1  1  1
4  1  1  1  1  1
5  1  1  1  1  1
5  3  3  3  3  3
6  3  3  3  3  3
7  3  3  3  3  3
8  3  3  3  3  3
9  3  3  3  3  3

In [159]:
pd.concat([df1,df2,df3], axis =0)

C:\Users\LENOVO\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     a    b    c    d  e    f    g    h    i
1  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
2  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
4  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
5  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
5  3.0  3.0  3.0  3.0  3  NaN  NaN  NaN  NaN
6  3.0  3.0  3.0  3.0  3  NaN  NaN  NaN  NaN
7  3.0  3.0  3.0  3.0  3  NaN  NaN  NaN  NaN
8  3.0  3.0  3.0  3.0  3  NaN  NaN  NaN  NaN
9  3.0  3.0  3.0  3.0  3  NaN  NaN  NaN  NaN

In [160]:
#merging

import numpy as np
import pandas as pd

In [175]:
df1 = pd.DataFrame({'key1':[1,2,3] ,'a':[2,3,4] ,'b':[5,6,7]})
df2 = pd.DataFrame({'key1':[1,2,3] ,'c':[1,2,9] ,'d':[5,8,9]})

In [176]:
df2

   key1  c  d
0     1  1  5
1     2  2  8
2     3  9  9

In [177]:
pd.merge(df1,df2)

   key1  a  b  c  d
0     1  2  5  1  5
1     2  3  6  2  8
2     3  4  7  9  9

In [178]:
pd.merge(df1,df2, how ='inner')

   key1  a  b  c  d
0     1  2  5  1  5
1     2  3  6  2  8
2     3  4  7  9  9

In [179]:
pd.merge(df1,df2, how ='inner', on = 'key1')

   key1  a  b  c  d
0     1  2  5  1  5
1     2  3  6  2  8
2     3  4  7  9  9

In [180]:
pd.merge(df1,df2, how ='outer', on = 'key1')

   key1  a  b  c  d
0     1  2  5  1  5
1     2  3  6  2  8
2     3  4  7  9  9

In [191]:
df1 = pd.DataFrame({'a':[2,3,4] ,'b':[5,6,7],'key1':[1,2,3],'key2':[5,2,3] })
df2 = pd.DataFrame({'c':[1,2,9] ,'d':[5,8,9],'key1':[1,2,3],'key2':[5,2,3] })

In [192]:
pd.merge(df1,df2, how ='outer', on = 'key1')

   a  b  key1  key2_x  c  d  key2_y
0  2  5     1       5  1  5       5
1  3  6     2       2  2  8       2
2  4  7     3       3  9  9       3

In [193]:
pd.merge(df1,df2, how ='right', on = 'key1')

   a  b  key1  key2_x  c  d  key2_y
0  2  5     1       5  1  5       5
1  3  6     2       2  2  8       2
2  4  7     3       3  9  9       3

In [194]:
pd.merge(df1,df2, how ='right', on = ['key1','key2'])

   a  b  key1  key2  c  d
0  2  5     1     5  1  5
1  3  6     2     2  2  8
2  4  7     3     3  9  9

In [195]:
#more operations with pandas

import numpy as np
import pandas as pd

In [203]:
x = pd.DataFrame({'a':[1,2,3,4,5], 'b':[20,50,40,30,50]})

In [204]:
x

   a   b
0  1  20
1  2  50
2  3  40
3  4  30
4  5  50

In [205]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [206]:
x.columns

Index(['a', 'b'], dtype='object')

In [207]:
x['b'].sum()

190

In [208]:
def inc(x):
    x = x + 100
    return x

In [209]:
x['b'].apply(inc)

0    120
1    150
2    140
3    130
4    150
Name: b, dtype: int64

In [212]:
x.sort_values('b') #sorting according to b

   a   b
0  1  20
3  4  30
2  3  40
1  2  50
4  5  50

In [215]:
x['b'].unique()

array([20, 50, 40, 30], dtype=int64)

In [218]:
x['b'].nunique() #number of unique values in b

4

In [220]:
x['b'].value_counts() #count of values

50    2
30    1
20    1
40    1
Name: b, dtype: int64

In [221]:
x.isnull()

       a      b
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

In [229]:
#loading data using pandas

#json(dictn in files), csv(data in files),excel,html
#html files - pip install html5lib
#csv files

In [230]:
import pandas as pd

In [233]:
x = pd.read_csv('shows.csv') # to upload csv file

In [234]:
x

    age  gender                       shows
0     5       1                    cartoons
1     7       1                    cartoons
2     9       1                    cartoons
3     5       0        Art & Cartoons shows
4     7       0        Art & Cartoons shows
5     9       0        Art & Cartoons shows
6    11       1           Educational shows
7    13       1           Educational shows
8    16       1           Educational shows
9    20       1  Reality shows & web series
10   23       1  Reality shows & web series
11   25       1  Reality shows & web series
12   26       1     Travel or Holiday shows
13   29       1     Travel or Holiday shows
14   30       1     Travel or Holiday shows
15   31       1         News & Comedy shows
16   33       1         News & Comedy shows
17   37       1         News & Comedy shows
18   20       0         Sitcom & web series
19   21       0         Sitcom & web series
20   25       0         Sitcom & web series
21   26       0               Fashion shows
22   27       0               Fashion shows
23   30       0               Fashion shows
24   31       0                  Tv Serials
25   34       0                  Tv Serials
26   35       0                  Tv Serials
27   36       1               Sports & News
28   38       1               Sports & News
29   39       1               Sports & News
30   40       0             Classical Drama
31   43       1    News & Traditional shows
32   45       1    News & Traditional shows
33   42       0           Traditional shows
34   45       0           Traditional shows
35   46       1    News & Traditional shows